DiplomD/src/DataProcessors/СформироватьЗаписиВЖурналеВыдачиЭкзаменационныхВедомостей/СформироватьЗаписиВЖурналеВыдачиЭкзаменационныхВедомостей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>СформироватьЗаписиВЖурналеВыдачиЭкзаменационныхВедомостей</name>
  <attributes>
    <name>ПериодСессии</name>
    <type>
      <types>CatalogRef.ПланСдачиСессии</types>
    </type>
  </attributes>
  <attributes>
    <name>Семестр</name>
    <type>
      <types>EnumRef.Семестры</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаСессии</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияСессии</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФормаОбучения</name>
    <type>
      <types>CatalogRef.ФормыОбучения</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧ</name>
    <attributes>
      <name>Ведомость</name>
      <type>
        <types>DocumentRef.ЗачетноЭкзаментационнаяВедомость</types>
      </type>
    </attributes>
    <attributes>
      <name>Группа</name>
      <type>
        <types>CatalogRef.Группы</types>
      </type>
    </attributes>
    <attributes>
      <name>Дисциплина</name>
      <type>
        <types>CatalogRef.РабочаяПрограммаДисцилины</types>
      </type>
    </attributes>
    <attributes>
      <name>Принял</name>
      <type>
        <types>CatalogRef.ПреподавательскийСостав</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

DiplomD/src/Documents/ЗачетноЭкзаментационнаяВедомость/ЗачетноЭкзаментационнаяВедомость.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗачетноЭкзаментационнаяВедомость</name>
  <attributes>
    <name>Группа</name>
    <type>
      <types>CatalogRef.Группы</types>
    </type>
  </attributes>
  <attributes>
    <name>Семестр</name>
    <type>
      <types>EnumRef.Семестры</types>
    </type>
  </attributes>
  <attributes>
    <name>Дисциплина</name>
    <type>
      <types>CatalogRef.РабочаяПрограммаДисцилины</types>
    </type>
  </attributes>
  <attributes>
    <name>Преподаватель</name>
    <type>
      <types>CatalogRef.ПреподавательскийСостав</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроведения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ФормированиеУчебныхГрупп</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФормаАттестации</name>
    <type>
      <types>EnumRef.АттестационныеМероприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Выдана</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокСтудентов</name>
    <attributes>
      <name>Студент</name>
      <type>
        <types>CatalogRef.СписокСтудентов</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерЗачетнойКнижки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Оценка</name>
      <type>
        <types>Number</types>
        <types>EnumRef.ВидыОценокЗачет</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НеЯвка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПромежуточнаяАттестацияПоДисциплине</name>
    <attributes>
      <name>Студент</name>
      <type>
        <types>CatalogRef.СписокСтудентов</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбъемДисциплины</name>
      <type>
        <types>CatalogRef.ОбъемыПромежуточнойАттестации</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбщийБаллУчебногоРейтинга</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СреднийБалл</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>рекомендуемаяОценка</name>
      <type>
        <types>Number</types>
        <types>EnumRef.ВидыОценокЗачет</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

DiplomD/src/Documents/ЖурналВыдачиЭкзаменационныхВедомостей/ЖурналВыдачиЭкзаменационныхВедомостей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЖурналВыдачиЭкзаменационныхВедомостей</name>
  <attributes>
    <name>ПериодСессии</name>
    <type>
      <types>CatalogRef.ПланСдачиСессии</types>
    </type>
  </attributes>
  <attributes>
    <name>Семестр</name>
    <type>
      <types>EnumRef.Семестры</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаСессии</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияСессии</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФормаОбучения</name>
    <type>
      <types>CatalogRef.ФормыОбучения</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧ</name>
    <attributes>
      <name>Ведомость</name>
      <type>
        <types>DocumentRef.ЗачетноЭкзаментационнаяВедомость</types>
      </type>
    </attributes>
    <attributes>
      <name>Группа</name>
      <type>
        <types>CatalogRef.Группы</types>
      </type>
    </attributes>
    <attributes>
      <name>Дисциплина</name>
      <type>
        <types>CatalogRef.РабочаяПрограммаДисцилины</types>
      </type>
    </attributes>
    <attributes>
      <name>Принял</name>
      <type>
        <types>CatalogRef.ПреподавательскийСостав</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

DiplomD/src/Catalogs/ПланСдачиСессии/ПланСдачиСессии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПланСдачиСессии</name>
  <attributes>
    <name>Семестр</name>
    <type>
      <types>EnumRef.Семестры</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодНачалаСессии</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодОкончанияСессии</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФормаОбучения</name>
    <type>
      <types>CatalogRef.ФормыОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоСеметраДляТестов</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонецСеместраДляТестов</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

DiplomD/src/DataProcessors/СформироватьЗаписиВЖурналеВыдачиЭкзаменационныхВедомостей/Forms/Форма/Module.bsl
&НаСервере
Процедура ТЧВедомостьПриИзмененииНаСервере(Ссылка,Группа,Дисц,Принял)
Запрос = Новый Запрос; 
Запрос.Текст = "ВЫБРАТЬ
               |	ЗачетноЭкзаментационнаяВедомость.Группа КАК Группа,
               |	ЗачетноЭкзаментационнаяВедомость.Дисциплина КАК Дисциплина,
               |	ЗачетноЭкзаментационнаяВедомость.Преподаватель КАК Преподаватель
               |ИЗ
               |	Документ.ЗачетноЭкзаментационнаяВедомость КАК ЗачетноЭкзаментационнаяВедомость
               |ГДЕ
               |	ЗачетноЭкзаментационнаяВедомость.Ссылка = &Ссылка";
запрос.УстановитьПараметр("Ссылка",Ссылка); 
Рез = Запрос.Выполнить().Выбрать(); 
рез.Следующий(); 
Группа = рез.Группа; 
Дисц  = рез.Дисциплина; 
Принял = рез.Преподаватель; 
	
КонецПроцедуры

&НаКлиенте
Процедура ТЧВедомостьПриИзменении(Элемент)
	Стр = Элементы.ТЧ.ТекущиеДанные; 
	ссылка = Стр.Ведомость; 
	Группа = "";
	Дисц = "";
	Принял = "";
	ТЧВедомостьПриИзмененииНаСервере(Ссылка,Группа,Дисц,Принял); 
	Стр.Группа = Группа; 
	Стр.Дисциплина = Дисц; 
	Стр.Принял = Принял; 
КонецПроцедуры

&НаСервере
Процедура ФормаСформироватьПереченьВедомостейНаСервере()
	Запрос = Новый Запрос; 
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗачетноЭкзаментационнаяВедомость.Ссылка КАК Ссылка,
	               |	ЗачетноЭкзаментационнаяВедомость.Группа КАК Группа,
	               |	ЗачетноЭкзаментационнаяВедомость.Дисциплина КАК Дисциплина,
	               |	ЗачетноЭкзаментационнаяВедомость.Преподаватель КАК Преподаватель
	               |ИЗ
	               |	Документ.ЗачетноЭкзаментационнаяВедомость КАК ЗачетноЭкзаментационнаяВедомость
	               |ГДЕ
	               |	ЗачетноЭкзаментационнаяВедомость.Семестр = &Семестр
	               |	И ЗачетноЭкзаментационнаяВедомость.Выдана = &Выдана"; 
	запрос.УстановитьПараметр("Семестр",объект.Семестр); 
	Запрос.УстановитьПараметр("Выдана",Ложь); 
	рез = Запрос.Выполнить().Выгрузить(); 
	Для каждого стр из рез Цикл 
		О = Объект.ТЧ.Добавить(); 
		О.Ведомость = Стр.Ссылка; 
		О.Группа = Стр.Группа; 
		О.Дисциплина = Стр.Дисциплина; 
		О.Принял = Стр.Преподаватель; 
		
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ФормаСформироватьПереченьВедомостей(Команда)
	ФормаСформироватьПереченьВедомостейНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПериодСессииПриИзмененииНаСервере()
	Спр = Справочники.ПланСдачиСессии.НайтиПоНаименованию(Объект.периодСессии); 
	Объект.ДатаНачалаСессии = Спр.ПериодНачалаСессии; 
	Объект.ДатаОкончанияСессии = Спр.периодОкончанияСессии; 
	Объект.Семестр = Спр.Семестр; 
	Объект.ФормаОбучения = Спр.ФормаОбучения;
КонецПроцедуры

&НаКлиенте
Процедура ПериодСессииПриИзменении(Элемент)
	ПериодСессииПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура СоздатьЗаписьВЖурналеУчетаВыдачиВедомостейНаСервере()
	Док = Документы.ЖурналВыдачиЭкзаменационныхВедомостей.СоздатьДокумент(); 
	Док.Дата = ТекущаяДата(); 
	Док.периодСессии = объект.периодСессии; 
	Док.Семестр = Объект.Семестр; 
	Док.ДатаНачалаСессии = Объект.ДатаНачалаСессии; 
	Док.ДатаОкончанияСессии = Объект.ДатаОкончанияСессии; 
	Док.ФормаОбучения = Объект.ФормаОбучения; 
	Для каждого стр из Объект.ТЧ Цикл 
		О = Док.ТЧ.Добавить(); 
		О.Ведомость = Стр.Ведомость; 
		о.Группа = Стр.Группа; 
		О.Дисциплина = стр.Дисциплина; 
		О.Принял = Стр.Принял; 
		Запрос = Новый Запрос; 
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЗачетноЭкзаментационнаяВедомость.Номер КАК Номер
		               |ИЗ
		               |	Документ.ЗачетноЭкзаментационнаяВедомость КАК ЗачетноЭкзаментационнаяВедомость
		               |ГДЕ
		               |	ЗачетноЭкзаментационнаяВедомость.Ссылка = &Ссылка";
		Запрос.УстановитьПараметр("Ссылка",Стр.Ведомость); 
		Рез = Запрос.Выполнить().Выбрать(); 
		рез.Следующий(); 
		Док2 = Документы.ЗачетноЭкзаментационнаяВедомость.НайтиПоНомеру(Рез.Номер).ПолучитьОбъект(); 
		Док2.Выдана = Истина; 
		Док2.Записать(РежимЗаписиДокумента.Запись); 
		Док2.Записать(РежимЗаписиДокумента.Проведение); 
	КонецЦикла;  
	Попытка 
		Док.Записать(РежимЗаписиДокумента.Запись); 
		Док.Записать(РежимЗаписиДокумента.Проведение); 
		Сообщить("Создана запись в журнале выдачи ведомостей"); 
	Исключение 
		Сообщить("Журнал НЕ создан"); 
	КонецПопытки; 
	
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗаписьВЖурналеУчетаВыдачиВедомостей(Команда)
	СоздатьЗаписьВЖурналеУчетаВыдачиВедомостейНаСервере();
КонецПроцедуры
